spec/assets/cart_customer.set.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:Magento" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
    <SOAP-ENV:Body>
        <ns1:call>
            <sessionId xsi:type="xsd:string">token</sessionId>
            <resourcePath xsi:type="xsd:string">cart_customer.set</resourcePath>
            <args SOAP-ENC:arrayType="xsd:ur-type[2]" xsi:type="SOAP-ENC:Array">
                <item xsi:type="xsd:int">1212</item>
<item xsi:type="ns2:Map">
              <item>
                <key xsi:type="xsd:string">firstname</key>
                <value xsi:type="xsd:string">Matteo</value>
              </item>
              <item>
                <key xsi:type="xsd:string">lastname</key>
                <value xsi:type="xsd:string">Parmi</value>
              </item>
              <item>
                <key xsi:type="xsd:string">website_id</key>
                <value xsi:type="xsd:string">1</value>
              </item>
              <item>
                <key xsi:type="xsd:string">group_id</key>
                <value xsi:type="xsd:string">1</value>
              </item>
              <item>
                <key xsi:type="xsd:string">store_id</key>
                <value xsi:type="xsd:string">1</value>
              </item>
              <item>
                <key xsi:type="xsd:string">email</key>
                <value xsi:type="xsd:string">teo@blomming.com</value>
              </item>
              <item>
                <key xsi:type="xsd:string">mode</key>
                <value xsi:type="xsd:string">guest</value>
              </item>
              </item>
            </args>
        </ns1:call>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

