dev/api-tests/integration/testsuite/Api/_fixture/_data/request_invalid_structure.xml

<soapenv:Envelope
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:login soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <username xsi:type="xsd:string">qqq</username>
         <!--apiKey xsi:type="xsd:string">qqq</apiKey-->
      </urn:login>
   </soapenv:Body>
</soapenv:Envelope>
