test/request-response-samples/multiCall__rpc_stype_request_xsi_attributes/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:multiCall xmlns:ns1="urn:Magento">
			<sessionId>sessionId</sessionId>
			<calls>
				<item xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:Array">
					<item>product_stock.update</item>
					<item xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:Array">
						<item>HTC Touch Diamond</item>
						<item xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="http://xml.apache.org/xml-soap" xsi:type="ns2:Map">
							<item>
								<key>qty</key>
								<value>9199</value>
							</item>
							<item>
								<key>is_in_stock</key>
								<value>1</value>
							</item>
						</item>
					</item>
				</item>
			</calls>
		</ns1:multiCall>
</soap:Body>
</soap:Envelope>