test.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:Magento" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <SOAP-ENV:Body>
    <ns1:login>
      <username xsi:type="xsd:string">carlos.guzman</username>
      <apiKey xsi:type="xsd:string">ff632e81bf366ceb99d2f7d50d21991f</apiKey>
    </ns1:login>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
